### Tidy Data

* Some data formats are hard to analyze in R
  * Data is often organised to facilitate data entry or search (web or other) not data entry 

* Tidy data is a consistent format to organise data in R
 *  Makes it easy to wrangle data across different representations required for data analysis

* Non-redundant structure makes it easy to maintain data
* Consider the following dataset, which describes:
  * Number of TB cases documented (1) by the World Health Organization in (2) Afghanistan, Brazil, and China between 1999 (3) and 2000 (4).

  * The data is structured in 4 different ways

### Orgnaizing Data: Intuition

* How would you organize the following dataset? 


![](https://www.dropbox.com/s/l8ibvzf67yx2vaw/table_3.png?dl=1)

### Orgnaizing Data: Intuition - Cont'd

* How would you organize the following dataset? 


![](https://www.dropbox.com/s/8buyoskg6uqnzr2/table_4a.png?dl=1)

In [5]:
library(tidyverse)

── Attaching packages ─────────────────────────────────────── tidyverse 1.3.0 ──

✔ ggplot2 3.3.5     ✔ purrr   0.3.4
✔ tibble  3.0.3     ✔ dplyr   1.0.2
✔ tidyr   1.1.2     ✔ stringr 1.4.0
✔ readr   2.0.2     ✔ forcats 0.5.0

── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [22]:
table1

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [7]:
table2

   country     year type       count
1  Afghanistan 1999 cases             745
2  Afghanistan 1999 population   19987071
3  Afghanistan 2000 cases            2666
4  Afghanistan 2000 population   20595360
5  Brazil      1999 cases           37737
6  Brazil      1999 population  172006362
7  Brazil      2000 cases           80488
8  Brazil      2000 population  174504898
9  China       1999 cases          212258
10 China       1999 population 1272915272
11 China       2000 cases          213766
12 China       2000 population 1280428583

In [8]:
table3

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

In [9]:
table4a

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

In [10]:
table4b

  country     1999       2000
1 Afghanistan   19987071   20595360
2 Brazil       172006362  174504898
3 China       1272915272 1280428583

### Question Related to Final Project

* How did we manage to get access to the tables without explicitly reading them?

### Rules for Tidy Data


* There are three interrelated rules which make a dataset tidy:
  * Each variable must have its own column.
    * Don't merge variables in a single column.
    * Decouple if in doubt
    * A variable is something that we measure. The name of the column is the description of that *thing* we measure.
  * Each observation must have its own row.
    * It may seem elegant to have an observation split across multiple rows to avoid long complicated observations
  * Each value must have its own cell.

![](https://www.dropbox.com/s/cowy26mbc2hc27q/Fig_12._1.png?dl=1)

### Rules for Tidy Data - Cont 'd

* Put each dataset in a table (data.frame or tibble)

* A compact dataset is not always the solution
  * Acceptable to havesome minimal level of redundancy if it facilitates the analysis or plotting

### Pivot a Dataset
* Data pivoting rearranges the columns and rows in a different way.
* Pivoting a dataset is commonly used to group observations spread across multiple columns or multiple rows
* Issue: Merging more than one observation in one leads to a wide data set.
  * Solution: Convert the wide dataset to a long dataset using `pivot_longer()`
  * Split a row using a couple of variables
* Issue: Splitting an observation leads to an unnecessarily long dataset
  * Solution: Convert the long dataset to a wide dataset using `pivot_wider()`
  * I.e., merge rows using some common variable value

In [11]:
# What is the issue with this dataset?

table4a

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

### Convert data from wide to long

* We need to:
  * Convert `1999` and `2000` to actual values of a column, say `year`
  * Store values held in the column 1999 and 2000 into a new variable, say cases 
* Note how that converts a wide data to a long data  
  * Increases the number of rows and decreases the number of columns.
  
![](https://www.dropbox.com/s/tw4k4jxmhtcv7vz/Fig_12_2.png?dl=1)

In [12]:
table4a %>% 
  pivot_longer(c(`1999`, `2000`), names_to = "year", values_to = "cases")

  country     year cases
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

In [13]:
table4b

  country     1999       2000
1 Afghanistan   19987071   20595360
2 Brazil       172006362  174504898
3 China       1272915272 1280428583

In [14]:
table4b %>% 
  pivot_longer(c(`1999`, `2000`), names_to = "year", values_to = "population")

  country     year population
1 Afghanistan 1999   19987071
2 Afghanistan 2000   20595360
3 Brazil      1999  172006362
4 Brazil      2000  174504898
5 China       1999 1272915272
6 China       2000 1280428583

### Joining Data

* Data should be joined when the data is observation related
* Join won't lead to unnecessary redundancy
  * Example: adding meta data to each entry

```R
left_join(tidy4a, tidy4b)
```

In [16]:
tidy4a = table4a %>% 
  pivot_longer(c(`1999`, `2000`), names_to = "year", values_to = "cases")
tidy4b = table4b %>% 
  pivot_longer(c(`1999`, `2000`), names_to = "year", values_to = "population")

In [20]:
left_join(tidy4a, tidy4b, by=c('country', 'year'))

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

### Convert a Data from Long to Wide

* Use it when an observation is scattered across multiple rows
* Needs the column whose values will be converted into variables
* Name of the column to assign values to
* Make tables wider 
 * Less rows and more columns than in the original table

![](https://www.dropbox.com/s/ttuq14z9dk195xa/Fig_12_3.png?dl=1)

In [21]:
table2

   country     year type       count
1  Afghanistan 1999 cases             745
2  Afghanistan 1999 population   19987071
3  Afghanistan 2000 cases            2666
4  Afghanistan 2000 population   20595360
5  Brazil      1999 cases           37737
6  Brazil      1999 population  172006362
7  Brazil      2000 cases           80488
8  Brazil      2000 population  174504898
9  China       1999 cases          212258
10 China       1999 population 1272915272
11 China       2000 cases          213766
12 China       2000 population 1280428583

# One variable, one column
* Often, variables are joined using some special character
  * FirstName/LastName
  * Lat/Long
  * City, state
* The value used is often non-alpha numeric
* Function `seperate()` simplifies separating values
  * Splits by default non-alpha numeric characters
  * Resulting cols are of type char

In [22]:
table3

  country     year rate
1 Afghanistan 1999 745/19987071
2 Afghanistan 2000 2666/20595360
3 Brazil      1999 37737/172006362
4 Brazil      2000 80488/174504898
5 China       1999 212258/1272915272
6 China       2000 213766/1280428583

In [23]:
table3 %>% 
  separate(rate, into = c("cases", "population"))

  country     year cases  population
1 Afghanistan 1999 745    19987071
2 Afghanistan 2000 2666   20595360
3 Brazil      1999 37737  172006362
4 Brazil      2000 80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [32]:
test=tibble("city/state"= c("Honolulu, HI", "Los Angeles, CA") )
test

  city/state
1 Honolulu, HI
2 Los Angeles, CA

In [33]:
test %>% 
 separate("city/state", into = c("city", "state"))

Warning message:
“Expected 2 pieces. Additional pieces discarded in 1 rows [2].”

  city     state
1 Honolulu HI
2 Los      Angeles

In [34]:
test %>% 
 separate("city/state", into = c("city", "state"), sep = ",")

  city        state
1 Honolulu     HI
2 Los Angeles  CA

In [29]:
table3 %>% 
  separate(rate, into = c("cases", "population"), convert = TRUE)

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

In [ ]:
### Combining Columns 

* `unite()` is the oppositve of `separate()`

 * Commonly used to combine dates or other variables that can be processed together

 * Uses the separator provided to combine values from two columns

In [17]:
# split on each two digits
table3 %>% 
  separate(year, into = c("century", "year"), sep=2)

  country     century year rate
1 Afghanistan 19      99   745/19987071
2 Afghanistan 20      00   2666/20595360
3 Brazil      19      99   37737/172006362
4 Brazil      20      00   80488/174504898
5 China       19      99   212258/1272915272
6 China       20      00   213766/1280428583

In [18]:
# split on each two digits
table3 %>% 
  separate(year, into = c("century", "year"), sep=2) %>%
  unite(new, century, year, country, sep="_")

  new               rate
1 19_99_Afghanistan 745/19987071
2 20_00_Afghanistan 2666/20595360
3 19_99_Brazil      37737/172006362
4 20_00_Brazil      80488/174504898
5 19_99_China       212258/1272915272
6 20_00_China       213766/1280428583

### Relational Data

* Data is often distributed across multiple files
  * You often must combine them to answer research questions
  * Collections of data related to the same problem are called relational 
    * The relations are used to enrich the data and add more information.

* Some of the most important operations on pairs of table are:

1- Mutating joins: which add new variables to one data frame from matching observations in another.

2- Filtering joins: which filter observations from one data frame based on whether or not they match an observation in the other table.

3- Set operations: which treat observations as if they were set elements.

 * We've covered those before.

* The operations above use concepts found in databases

![](https://www.researchgate.net/profile/Herodotos-Herodotou/publication/51753974/figure/fig2/AS:305691270107169@1449893886977/Database-Schema-Geno-Single-database-schema-for-the-Affymetrix-platform-In-this.png)

### Mutating Joins 

* useful for combining a pair of tables
  * first matches observations by their keys, then copies across variables from one table to the other.

* Like mutate(), the join functions add variables to the right, 
* Different types of joins:
  * Inner join. An inner join matches pairs of observations whenever their keys are equal:

![](https://www.dropbox.com/s/2hk50hhnbklqxn9/mutating_joins.png?dl=1)

In [42]:
x <- tribble(
  ~key, ~val_x,
     1, "x1",
     2, "x2",
     3, "x3"
)
y <- tribble(
  ~key, ~val_y,
     1, "y1",
     2, "y2",
     4, "y3"
)

In [43]:
x
y

  key val_x
1 1   x1
2 2   x2
3 3   x3

  key val_y
1 1   y1
2 2   y2
3 4   y3

In [44]:
x %>% 
  inner_join(y, by = "key")

  key val_x val_y
1 1   x1    y1
2 2   x2    y2

### Outer Joins
* Outer joins keep observations that appear in at least one of the tables. 
  * As opposed to inner join, which keeps observations that appear in both tables.

There are three types of outer joins:

* A left join keeps all observations in x.
* A right join keeps all observations in y.
* A full join keeps all observations in x and y.

![](https://www.dropbox.com/s/bx899q1nq3xdfbq/outer_joins.png?dl=1)

### Filtering Joins

* Filtering joins match observations in the same way as mutating joins
  * affect the observations, not the variables

* There are two types of filtering joins:
`semi_join(x, y)` keeps all observations in x that have a match in y.
`anti_join(x, y)` drops all observations in x that have a match in y.

![](https://www.dropbox.com/s/w2ngcxy4ssfuxyw/filtering_joins.png?dl=1)

### R Style Guide

* Like text, you should remember that you're writing code for others to read.

* Good coding style is like using correct punctuation. 

* Makes code easier to read and less ambiguous.

* There are many possible variations, some somewhat more popular than others.

* Before packaing your it's a good idea to use the formatR package
  * Makes it easier to clean up poorly formatted code. 
  
* It can’t do everything, but it can quickly get your code from terrible to pretty good. 
  * Looks only at format
  
For the rest, see http://adv-r.had.co.nz/Style.html